{"review": "\"Catch Me If You Can\" follows the life of Frank W. Abignale - one of the greatest con men of all time who single handedly lived his life on fradulant checks and scams that just leave you thinking how amazing he was. This book is the autobiographical account of Abignale's teenage years from when he first created a scam on his father's Mobil credit card. There are so many times in this book that I had to step back and think about the air of confidence that Abignale displayed, yet curiously inside he was often paranoid and worried about the authorities catching up to him. Some of the stories are absolutely outrageous. I loved them all! This book also talks about his time in prison across seas in Europe and how terrible he was treated in the French prisons. If you liked the movie then you should definately read this book. It further explores his adventures and exploits in greater detail and includes many capers that were not in the movie. A must read", "domain": "books", "label": "positive"}
{"review": "This book was very well written and so much fun to read. Frank Abagnale tells his story with the same flare and finesse that he pulled off the cons of his criminal career. Entertaining from start to finish", "domain": "books", "label": "positive"}
{"review": "We all know of Frank Abagnale's personality; arrogant, yet kind with class. Among all the different characters that he chooses to play, whether he's a pilot, doctor, lawyer, or a college professor, i believe that Frank is somewhat confused of who he is. Frank \"ran away\" from home at 16; the age of teenager who is only halfway through high school. At 16, most people don't know where they are in life or what to pursue in the future. One thing was for sure; Frank wanted money and women. I believe Frank's unique personality came from the way he was brought up. Having endured his parent's divorce at a young age was a life changing experience for him. It all started with his father; Frank Abagnale. During the process of his(Jr.'s) parent's divorce, his father still loved is mother. So Frank(Sr.) would try to get his son to say things like \"Talk to her son...tell her I love her. Tell her we'd be happier if we all lived together. Tell her you'd be happier if she came home, that all you kids would be happier.\" His(Jr's) father led him to the first step of manipulation. Frank stayed with his father after the finalizing of the divorce. Since his father was quite a rich man, he had a whole variety of rich friends and Frank(Jr.) would come in contact with his friends quite often. This is where Frank learned the \"attitude of the rich\", with confidence. Finally when Frank did his first con with his father's money, Frank(Sr.) forgave him. \"Look, son, if you'll tell us how you did this, and why, we'll forget it. There'll be no punishments and I'll pay the bills.\" Frank probably felt that he could get away with anything at this point and without any punishment, he didn't believe this to be a huge mistake. With confidence, manipulation, some class and little fear of breaking the law, we come to Frank Abagnale Jr.", "domain": "books", "label": "positive"}
{"review": "Frank Abagnale Jr. stands as one of the greatest con artists of all time. The story is inflated at times (in the introduction he claims to turn on the autopilot of a commercial jet liner, a task that in fact requires the actual ability to fly the plane to begin with). Still, the Catch Me If You Can is engaging, and Abignale's scams combine inventiveness and good humor. Enjoy", "domain": "books", "label": "positive"}
{"review": "If you, like me, have seen the film with Leonardo DiCaprio and Tom Hanks and are playing with the idea of reading the book, you are reading the right review!  If you were in front of me, I would look at you with a grin (as if to show that I knew something you didn't) and encourage you to do so. Frank Abagnale is less likable in the book, which is to be expected, but is still far from what we would consider a true villain.  It caught me by surprise about halfway through how I was so fascinated by a crook with little or no moral values.  I suppose this is how we live out our own bit of villainy.  Overall, a fun read that may possibly help you appreciate the film even more", "domain": "books", "label": "positive"}
{"review": "I read this book after watching the movie (staring Tom Hanks and Leonardo DiCaprio). Before I started I knew I liked the story, but I didn't realize how much. I loved reading Abagnale's account of his life of crime. I enjoyed hearing of his exploits as an airline pilot, a doctor, a professor, and a lawyer. I also liked the novel's open frankness about the author's misdeeds. However, I thought the book was not especially well written. Abagnale recounts his adventures dryly and with little emotion. I also felt somewhat deprived with the novel's ending. Frank Abagnale went on to work for law enforcement and securities firms, but that is only mentioned in a question and answer with the author after the story. I would have liked to have heard more about how he crossed from the wrong side of the law to the right. All in all, I would recommend this book as an easy weekend read", "domain": "books", "label": "positive"}
{"review": "Many people became aware of Frank Abagnale Jr's story until the movie starring Tom Hanks and Leonardo Dicapprio was released (even though an earlier movie based on this story was released). While not as flowing as the movie, the story told in this book seems much more realistic and true too life, containing many of Abagnale's earlier mistakes & lessons we  don't get to see in the movie. On the other hand, many parts of it do seem to be missing - such as why Air France would take such an interest in catching Frank, even though the airlines he was cheating seemed to be mostly American based? This is an interesting read as a background to the movie, and to those who would like to learn what had inspired many of the movie's major storylines", "domain": "books", "label": "positive"}
{"review": "Not a reader of fiction, fantasy, sci-fi... therefore picked up a copy of \"Catch Me If You Can\" from a bookstore yesterday... Seen the film more than 10times.. loved the film, loved the characters, loved the plot... LOVED the book even more... can't put it down... the story just flows perfectly... Makes you wonder what Franky can do at the age of 16,17 etc. A real inspiration... the book's plot is BY-FAR better than the movie... Would have been great to read it before watching the film.. still good to read it after watching the film.. Overall, it's a great book finished it in a da", "domain": "books", "label": "positive"}
{"review": "Ideal for anyone with an interest in evading capture", "domain": "books", "label": "positive"}
{"review": "First, I want to say that this is the paperback version of The Cooks Illustrated Complete Book of Poultry (different title, different cover design.) This is a great book especially for those who eat a lot of chicken and are looking for a variety of ways to prepare it, like me. There are recipes for dishes from many different traditions, which I like, and all are tasty. If you look at the table of contents, you'll see that they are arranged by cooking method, which is handy. And the book has all the explanations and clear directions typical of Cooks Illustrated books. My absolutely only complaint is that I appreciate it when an entire recipe is printed across two open pages, so I can put it in my cookbook stand and leave it there, and that is not the case here: I have to turn the page. But that's minor. Highly recommended", "domain": "books", "label": "positive"}
{"review": "This is the sort of cookbook that grows with you.  If you're a novice cook, or you cook only because you have to put something on the table every night, you will find this book enlarges the number of fool-proof chicken dishes you can put on the table without much fuss.  Each chapter suggests several variations, so you can adapt to what you have on hand or what's fresh at the store.  There are also handy chapters on soup, leftovers and turkey breasts. If you're a more seasoned or adventurous cook-or you'd like to become one!-you will appreciate the scope of the book, which provides basic recipes in 37 chapters, including what to do with duck, goose, quail, squab, and pheasant.  With a proven \"method\" at hand, you can experiment with seasonings & vegetables and feel confident that your new creation will at least be edible.  Or if you prefer to stick to the book, there are more complex dishes here, such as Saut\u001aed Butterflied Chicken with Tomato, Olive and Caper Pan Sauce and Grilled Squab with Red Chile-Pumpkin Seed Sauce. If you like America's Test Kitchen or Cook's Illustrated, this book is a guaranteed winner.  Even if that's not you style, you might find the abundance of recipes makes this a winner anyways.  Best of all, it's affordable", "domain": "books", "label": "positive"}
{"review": "The books are indeed a masterpiece collection of sorts. Very racy and laced with black humor and the sort of a plot which you can put into a perspective, for instance, the reference to mob psychology harks about to blacks burned/lynched in 1930's America, to many such instances in third world countries like India and Pakistan where many a woman, child and man have been victimc of such outbursts born out of sheer greed or religious intolerance. For instance there is a Muslim Religious leader in Australia saying that women invite rape by exposing their body parts. WOW! Count Olaf, indeed! The writer is not shedding tears for the children here or is presenting a bleak picture for us to salivate on but is really afraid for us and trying to make us careful in our decisions and largely he is trying, most explicitly, to say that a family should bond well together - for all other relationships are transitory. A very practical one! Should I say!", "domain": "books", "label": "positive"}
{"review": "Plot: interesting. Suspence: present. Entertainment: keep. Hidden messages: a few. Book ranking for series: 5th Mysteries: Hospital related only", "domain": "books", "label": "positive"}
{"review": "Dear Reader, Unlike previous books in the series, THE HOSTILE HOSPITAL takes place immediately after THE VILE VILLAGE.  The three Baudelaire children are all alone walking across a large empty space when the reach The Last Chance General Store.  The children had just escaped from V.F.D. the evening before and were now wanted by the police for the murder of Jacques Snicket.  Mixed-up and misrepresentations of the deeds were going to appear in the morning edition of THE DAILY PUNCTILIO.  Hungry and without another chance in the world, the children enter The Last Chance. It's too terrible to describe what horrors are inflicted upon them there.  Somehow the escape and make their way to the Heimlich Hospital where they join with a group of singing people known as the V.F.D., Volunteers Fighting Disease.  It's not the V.F.D. that their parents were members of, but this V.F.D. inadvertently assist the Baudelaire's in finding new information about their parents. Oh, my.  But that was before Violet was captured by Count Olaf, before she was supposed to have her head removed, and before a major fire.  Oh, those poor children!  I can't write about them anymore at the moment.  Read about them yourself. I think I'll go buy a heart-shaped balloon to make me feel better because my stomach feels queasy. Sincerely, Uncle T", "domain": "books", "label": "negative"}
{"review": "The first seven books of A Series of Unfortunate Events followed the same formula. The Baudelaire Orphans are with the banker Mr. Poe until he can find a new relative willing to care for the siblings. Things go badly and the evil Count Olaf shows up with another nefarious plan to kidnap the children and somehow steal their inheritance. In the end they get away and Olaf is on the run from the authorities. The ending of The Vile Village changes this. The Baudelaires are on the run, suspected of the murder of Count Olaf despite the fact that he isn't dead and that there is no way they could have committed the non-existent crime. The Hostile Hospital opens with the orphans trying to find a place where they can learn about VFD, the Quagmire triplets, and some clue that will help keep them safe and stop Count Olaf from coming after them ever again. This time there is no Mr. Poe and no new distant relative to live with. Count Olaf is in much less of this book than we have come to expect, though he and his cronies play major roles in instigating the action. Author Lemony Snicket (an assumed name as the author is as much a character in the story as the Baudelaires are) does an excellent job in presenting the story of the Baudelaires experiences at a hospital trying to research in the records room what the truth behind the events of the past several novels and once more running afoul of the minions of Count Olaf and being placed into mortal danger once again. Snicket sets up the next volume very well and tells the story in such a way that the novel flows into the next book while telling an independent story at the same time. The breaking of the formula of the series is a refreshing change and spices up the action quite a bit. The Hostile Hospital is one of the best of the first eight volumes in this series. -Joe Sherr", "domain": "books", "label": "negative"}
{"review": "This book is a concise well written guide to the core issues of buying, owning and selling multifamily buildings. It was extremely valuable in evaluating our first purchase of a multi-family structure", "domain": "books", "label": "positive"}
{"review": "As a real estate investor and author myself, I read a lot of real estate books. Many, if not most, are written by folks who do not invest in real estate themselves; they only write about it. Berges is not one of them. He knows his stuff and it's clear that he practices what he preaches. I have read three of his books and, I must say, he's one of my favorite real estate authors. You can trust what he says. Experienced investors may want a bit more detail from Steve, but what he does say is accurate and safe. This is a good book on buying apartments. In fact, in my own book, \"Investing in Duplexes, Triplexes & Quads,\" I list the best books I've read on different areas of real estate. This book is the ONLY book I recommend on investing in commercial multifamily (ie, apartments of 5 units and up) properties. Having given those accolades, here are a few of my constructive criticisms: 1. On pages 37 and 38, Steve gives nice charts illustrating the long-term financial benefits of investing in multifamily properties. On page 39, however, there is an error in referring to the big numbers shown. The reference is made to Investor A's \"equity\" of $2.1 million and Investor B's (the multifamily property investor) equity of $92 million. I just don't think Steve caught this, but those numbers don't refer to the investor's equity, but to the fair market value of his collective assets (his properties). The investor's equity might be in the range of 20% of that. I do like the charts, however, and I used a similar analysis in my recent book. One other note on the charts - they presume selling and buying exactly at the end of one year - a difficult task as Steve would surely admit. On average, I think 18 months to two years is a better time frame for flipping apartments. 2. Refinancing - Steve didn't give a chart showing the long-range effect of the \"buy, hold and refy\" strategy (using proceeds to buy again, but retaining the first property). In addition, Steve only mentioned the general banking guideline that you can only pull out cash up to 80% of the new appraised value (i.e., the bank has an LTV of 80%). However, you can get around this. I've done it. It requires a second lender giving a second mortgage, with a CLTV (combined loan to value) of up to 90%. As such, you can pull out much more cash. 3. GRM - gross rent multiplier. In his financial analysis section, Steve doesn't give much detail or provide real life examples on this crucial analysis factor. Granted, the cap rate is the analysis primarily used for commercial real estate, while the GRM is the one used for residential multifamily (2-4 units) real estate. Since many owners and selling brokers will \"fudge\" on expenses, a cap rate can be very hard to verify. The GRM, however, is fairly simple - just look at the lease agreements. 4. Lack of coverage on residential multifamily apartments. In fact, this is why I wrote my book on this topic. If Steve had covered it here, I would not have written mine. I like Steve's writing style and he knows his stuff. But for investing in small multifamily properties (certainly on residential, but probably up to about 10 units), we really have to cover valuation and selection of properties using the GRM. That and I felt like the \"buy, hold, and refy\" strategy needed much more coverage. But for investing in commercial multifamily properties, I recommend this book as the only good one on the market. Larry Loftis Author: Investing in Duplexes, Triplexes and Quads: The Fastest and Safest Way to Real Estate Wealth", "domain": "books", "label": "positive"}
{"review": "Excellent and reasonably comprehensive introduction to the business of investing in multifamily properties", "domain": "books", "label": "positive"}
{"review": "This is the second Steve Berges book that I've read.  I read his book, \"The Complete Guide to Real Estate Investing\".  He focused on obtaining value once you make the purchase.  That is very sound advice.  With so many people investing in property hoping to make a profit after they fix it, Steve urges you to pursue profitability prior to making any modifications.  Do not pursue property that requires capital investment or upgrades prior to a positive cash flow.  That's very basic but sage advice", "domain": "books", "label": "positive"}
{"review": "This was the first book I have purchased on the subject of real estate investing in multi-family properties.  I have been and interested in the subject for some time however. I found the formulas and rules the book includes to be invaluable, and used them to create Excel spreadsheets to quickly analyze the hundreds of multi-family listings available.  I found the book to be easy to read and understand.", "domain": "books", "label": "positive"}
{"review": "This is a great set if you are interested in knowing Bret \"Hitman\" Hart the man.  However, the matches leave much to be desired.  It seems that Bret focused more on choosing matches that were sentimental to him as opposed to what would be most memorable to fans.  Overall, I would still recommend this set because it is a first rate documentary.  However, if you want more wrestling and less documentary, you might want to spring for the Undertaker DVD", "domain": "dvd", "label": "negative"}
{"review": "This dvd set is truly wonderful and is a must have for every Bret Hart fan. It was long overdue and the dvd set does focus on the postive points of Bret's career", "domain": "dvd", "label": "positive"}
{"review": "This three disc set is a must-have for any wrestling fan. The first disc does a great job of telling the story of how he became the hitman and covers the controversy in montreal which forced him to leave wwe as well as his look back on the tragic passing of his brother Owen. The other two discs include most of the hitman's best matches. His match with HBK from wrestlemania 12 was left out probably because bret wanted it left out and maybe since it was a very long match. Some of the matches included are: WM 13 submission match vs. Austin, WM 10 vs. Owen, and his Summerslam '92 match against the British Bulldog. This is a great dvd set that does well with capturing the true essence of why Bret Hart was the Excellence of Execution. I believe this set includes a total of 18 hitman matches which were not only singles matches but also his matches from earlier in his career in tag team action along with Jim the Anvil Niedhart in the Hart Foundation. So this set is just great simply because it is comprehensive in its coverage of Bret's career from early wwe to his days in WCW. Buy this dvd set. YOU WILL NOT BE DISAPPOINTED", "domain": "dvd", "label": "positive"}
{"review": "The greatest wrestler to have ever graced a squared circle finally gets to shed light on his legacy.  Ever since Survivor Series '97...Bret Hart's career hasn't been labeled with the words \"Excellence Of Execution\" but with the word \"SCREWED\" and it's stayed that way for over close to 10 years and would have been kept that way for the rest of his life after the original annoucement that this DVD would be labeled \"Screwed: The Bret Hart Story.\" However, Bret stepped up & was able to erase that word from his legacy is replace it with \"Best There Is, Best There Was, Best There Ever Will Be\" and also made this one of the most \"unique\" DVD sets in WWE history. The early years of Bret growing up in the Hart household and breaking into his dad's Stampeed Wrestling kick the documentry off.  His entrance in to WWE and not really getting off to a good start (Cowboy Bret Hart?) until he finally teamed with Jim Neidhart & Jimmy Hart to form the Hart Foundation.  The Hart Foundation's dominance over the tag team division as well as Bret's ability to be a heel are glossed over before his road to the Intercontinental Championship and how important that championship was to his career (which is amazing compared to how it's being used in WWE today).  His classic matches featuring Roddy Piper (WrestleMania VIII & my favorite \"Hitman\" match), Mr. Perfect & British Bulldog (SummerSlam '91 & '92) are also looked upon leading up to his first WWE title reign (including highlights from the match with Flair that is rare to find), the impact is had on making him an international superstar, and how he was able to make to have people apprechate wrestling more over than Hulk Hogan's sports entertainment.  His fued with his brother Owen is discussed after Bret discusses his disappointment in how his first title reign ended (remember Hulk Hogan at WrestleMania IX?) and how he worked his way back to the title including the King Of The Ring tournament.  His disapointment in his third title reign being completely overlooked infavor of Shawn Michaels leading up to his WrestleMania XII Ironman Match.  The Ironman match is heavily discussed as Bret talks about how he thought everything (promos, commentary during the match) were in favor of HBK.  His return to WWE after his vacation and the heated fued between himself & Stone Cold Steve Austin is heavily discussed as well as the respect for one another.  Bret's last run which provoked a U.S.A. vs. Canada fued along with the new Hart Foundation is discussed leading up to the Survivor Series.  Survivor Series isn't heavily talked about but you get everyone's feelings now after they've had plently of times to reflect on their actions.  Bret's disappointing run in WCW is discussed along with Bret's favorite moments including the Owen Hart tribute match.  The profile on Bret rounds out with him talking about his stroke and how his life has been for the past few years. DVD extras include interview outtakes where Bret discusses certain issues like the name \"The Dungeon\", how Konnan taught Bret the Sharpshooter, a funny Owen story where he crankcalled Stu Hart, the story behind his sunglasses, and the whole Hart Family tree.  Also Bret pays tribute to his friends in the wrestling business who passed away along with his late brother Dean Hart.  Hidden extras were his \"You Start The Fire\" music video, an old Stampeed Wrestling interview featuring the Bushwackers (then known as the Sheepherders), and interview outtakes feauturing Bret discussing never injuring another wrestler, and where he got the name \"Hitman.\" Earlier I said this was the most unique DVD set in WWE history and that's because instead of following the usual pattern of putting high profile matches (title wins, most memorable matches), Bret picked out his personal favorite matches and most of which are rare and most people didn't know happened or were so low profile that people forget they happened.  These type of matches feature Ricky Steamboat, Bam Bam Bigelow, Ted Dibiase, Hakushi, Owen Hart, Undertaker and matches as the Hart Foundation against British Bulldogs, Killer Beez, and The Rockers.  Alot of Bret's PPV & high profile matches are included featuring himself as the Tag Team Champions The Hart Foundation against Nasty Boys (WrestleMania VII), two matches against Mr. Perfect (King Of The Ring '93) including his first Intercontinental Title win (SummerSlam '91), his WrestleMania X match against Owen Hart, his No Holds Barred match against WWE Champion Diesel (Survivor Series '95 & the only World Title win on his DVD), British Bulldog (In Your House), the Submission Match from WrestleMania 13 against Steve Austin (the audio is off by at least a second), and the Owen Hart tribute match from WCW Nitro against Chris Benoit. Overall, this is probably one of the best DVD sets that WWE has put out & is a fitting tribute to Bret \"The Hitman\" Hart.", "domain": "dvd", "label": "positive"}
{"review": "This dvd in my opinion is by far the best bio dvd done so far. The program part which runs around for a little more than 2 hrs is excellent. The eighteen matches that are on here are excellent. Its just a very well done and well deserved dvd to one of the greatest wrestlers of all time. I think they should have one more dvd cause there is more than enough great matches that didnt make this dvd. Here's what it should look like. Also according to articles ive read Bret recorded more than 7 hrs in interviews and only about 2 and half made the 1st dvd im not saying they have another documentary just some extra interview on the extras part of the dvd. Title: Excellence of Execution This should be like the undertaker dvd where a narrator setups each match. Would Be Prolly 10 Hrs. Disc 1 Match 1 WrestleMania III Six Man Tag Match The Hart Foundation & Danny Davis Vs The British Bulldogs & Tito Santana Match 2 SummerSlam 89 World Tag Team Title Match The Hart Foundation Vs The Brain Busters Match 3 SummerSlam 90 World Tag Team Title Match Best 2 out of 3 Falls The Hart Foundation Vs Demolition Smash & Crush Match 4 WrestleMania 8 Intercontinental Championship Match Bret Hart Vs Rowdy Piper Match 5 WWE PrimeTime 92 Ladder Match Bret Hart Vs Shawn Michaels Match 6 Royal Rumble 93 WWE Championship Bret Hart Vs Razor Ramon Match 7 SummerSlam 93 Bret Hart Vs Jerry Lawler Extra Interviews Hall Of Fame Speech Favorite Match Wrestling Mr. Perfect Wrestling Owen Wrestling Davey Boy Smith Lawler Fued Extras Pre Match Interview SummerSlam 90 Pre Match Interview WrestleMania 8 Promo on Royal Rumble 93 History of Jerry Lawler Feud Extra Matches WWE Championship 10-12-92 Bret Hart Vs Ric Flair WWE Debut Match Disc 2 Match 8 Wrestlefest (1-11-94) Bret & Owen Hart Vs The Steiner Brothers Match 9 King Of The Ring 94 WWE Championship Bret Hart Vs Diesel Match 10 SummerSlam 94 WWE Championship Steel Cage Match Bret Hart Vs Owen Hart Match 11 WrestleMania XII WWE Championship Iron Man Match Bret Hart Vs Shawn Michaels Match 12 Survivor Series 96 Bret Hart Vs Stone Cold Extras Interviews Hart Family Tradition Guys he Trained with Brian Pillman Favorite Match with Owen Hart family felt when he wrestled Owen Extra Accepts Stone Cold's Challenge Training Video for WrestleMania Promo on King Of The Ring 94 Promo on SummerSlam 94 Owen Interview in the cage before there match Bret interview at SummerSlam 94 Extra Matches WWE Raw 7-11-94 Bret Hart Vs 1-2-3 Kid Disc 3 Match 13 In Your House #12 WWE Championship Bret Hart Vs Sycho Sid Match 14 In Your House #14 Bret Hart Vs Stone Cold Match 15 In Your House #16 Canadian Stampede Eight Man Tag Team Match The Hart Foundation Vs Stone Cold ,Ken Shamrock, Goldust & LOD Match 16 Survivor Series 97 WWE Championship Bret Hart Vs Shawn Michaels Match 17 Mayhem 99 World Heavyweight Tournament Semi-Final Bret Hart Vs Sting Match 18 Mayhem 99 World Heavyweight Tournament Final Bret Hart Vs Chris Beniot Match 19 Starccade 99 World Heavyweight Championship Bret Hart Vs Goldberg Extra Interview Felt The Night After Survivor Series 97 Wrestling Beniot Concussion Perceived in WcW Extras History of the Stone Cold Feud Interview after Mayhem Promo for Survivor Series Promo for Starccade Mad TV Sketch Extra Matches In Your House #3 Bret Hart Vs Jean Pierre Lafite WcW Nitro U.S. Title Bret Hart Vs Diamond Dallas Page Now I think they should do a  Kurt Angle Dvd since he has just left the company and most likely will comeback but just in case he doesnt this would be a great tribute. \"The Wrestling Machine\" Chapters 1.  Growing Up 2.  Amatuer Wrestling 3.  Olympics 4.  WWE Debut 5.  King Of The Ring 6.  Grand Slam Champion 7.  The Rock 8.  WWE Title Reign 9.  Chris Beniot 10. WWE Vs WCW 11. Stone Cold 12. Edge Fued 13. Teaming With Beniot 14. Team Angle 15. Neck Surgery 16. Brock Lesner 17. Eddie Guerrero 18. WrestleMania 21/Michaels Fued 19. John Cena 20. World Heavyweight Title 21. ECW 22. Why He Left 23. Future In Business Extra Interviews Where He Came Up With The Three I's It's True Phrase Favorite Match Vince McMahon Worst Moment In Wrestling Team ECK Extras Promo Some of his promo with Edge & Christian with Mick Foley his promo with The Rock & Stone Cold during 01 Matches Match 1 Survivor Series 99 Single Match Kurt Angle Vs Shawn Stasiak Match 2 No Way Out 00 Intercontinental Championship Match Kurt Angle Vs Chris Jericho Match 3 King Of The Ring 00 Finals Kurt Angle Vs Rikishi Match 4 No Mercy 00 WWE Championship Kurt Angle Vs The Rock Match 5 Raw 11-27-00 WWE Championship Kurt Angle Vs Stone Cold Steve Austin Disc 2 Match 6 Backlash 01 30-Minute Submission Match Kurt Angle Vs Chris Beniot Match 7 King Of The Ring 01 Street Fight Kurt Angle Vs Shane McMahon Match 8 Uniforgiven 01 WWE Championship Kurt Angle Vs Stone Cold Steve Austin Match 9 Judgement Day 02 Hair Vs Hair Match Kurt Angle Vs Edge Match 10 SmackDown 5-30-02 Cage Match Kurt Angle Vs Edge Match 11 SummerSlam 02 Single Match Kurt Angle Vs Rey Misterio Match 12 No Mercy 02 WWE Tag Championship Kurt Angle & Chris Beniot Vs Edge & Rey Misterio Match 13 Royal Rumble 03 WWE Championship Kurt Angle Vs Chris Beniot Disc 3 Match 14 WrestleMania XIX WWE Championship Kurt Angle Vs Brock Lesner Match 15 Smackdown 9-30-03 WWE Championship Iron Man Match Kurt Angle Vs Brock Lesner Match 16 SummerSlam 04 Single Match Kurt Angle Vs Eddie Guerrero Match 17 Smackdown 3-17-05 Single Match Kurt Angle Vs Marty Janetty Match 18 WrestleMania 21 Single Match Kurt Angle Vs Shawn Michaels Match 19 No Way Out 06 World Heavyweight Championship Kurt Angle Vs The Undertaker Match 20 ECW Single Match 6-27-06 Kurt Angle Vs Rob Van Da", "domain": "dvd", "label": "positive"}
{"review": "The thing that gets me about Bret Everytime is his Sincerity. He always has and always will be a LOVER OF THE SPORT. More than anything else this set delivers, and it delivers all you could want, except maybe Bret beating down on Vince (just a personal fantasy) And you ALMOST get that too! But more than anything - you get tons of good solid, straight up talk from a man who dedicated himself to entertaining a public with something he loved - and was born and raised to do. He's had to endure some awful misfortune - but this guy shows us all how to stand up and fight - and not just for cash.", "domain": "dvd", "label": "positive"}
{"review": "I purchased this dvd because I own the 2nd one and like it so much.  Boy, was I disappointed!  The abs diet people must have decided to create the second dvd because this one needed a good edit.  The second dvd covers basically the same exercises but with better instruction and form.  Skip this one and buy the Abs Diet Workout 2", "domain": "dvd", "label": "negative"}
{"review": "I'm not keen on workout tapes or DVDs but I bought this because I got a deal when I bought the book, too.  But this is a great workout DVD with 3 levels, one right for everyone.  It doesn't take long to work out with it and the music that accompanies the action really gets you going.  I've lost 15 pounds in 6 weeks by using the Abs Diet book (it shouldn't be called a diet - more of a lifestyle change in a positive way that anyone can stick with) and the DVD", "domain": "dvd", "label": "positive"}
{"review": "I have dozens of workout videos and I have been religious about this one!  I usually just do beginning, intermediate and advanced for one long workout.  I disagree that it is only for women, I think it is for men too-but most men I know don't like working out to videos.  It is a great video and I have already recommended it to my friends", "domain": "dvd", "label": "positive"}
{"review": "This is the perfect DVD companion for the The Abs Diet Book. You eat more frequently, you eat consciously, and you exercise. It works !!! This plan keeps your metabolism at maximum speed all day long. I eat more than I ever ate before, and I have been able to keep in good shape. I was able to lost more than 200 lbs, I have been able to keep in shape for more than two years. I am in the best shape of my life thanks to The ABS Diet. The really important thing for me is not just that I look great, but that I feel great and that I am healthier than ever. Don't take my word, try the ABS diet and I am sure that you will get the results that you expect. Just stay in the plant until it becomes habit. !!! Another tools you may want to consider, to complement The ABS Diet DVD and book with your strategies for boosting your metabolism, loosing weight, and even more important keeping that weight off are: - A Body Fat Monitor or Scale. This will help you monitor your progress, to assure that the weight you are loosing is fat (fat lost = increased metabolism) and not muscle, water or bone mass (decreased metabolism). - A Heart Rate Monitor Wrist Watch. This is an excellent tool that will help you monitor and control your Heart Rate in order to keep yourself in a burning fat state (increased metabolism). - \"Ultrametabolism: The Simple Plan for Automatic Weight Loss\", which is another very practical, readable and insightful book, focused on how to boost your metabolism. - \"The Hard Body Guide\". Excellent strategies, programs and workouts, aimed to increase your muscle mass.", "domain": "dvd", "label": "positive"}
{"review": "I was wondering if this really works, because there's dvd's and books that just lie to get MILLIONS! and that bugs me a lot. I was wondering if it actually worked because it's sounds just \"too\" good. But I have read some positive things from this dvd. I was wondering if anyone out there that owns this could tell me and I would appreciate it. Thanks ;] *And for the 5 stars, I have no idea, so don't listen to that* Please tell me if it really works. okay thanks", "domain": "dvd", "label": "negative"}
{"review": "Just got the new DVD in and I love it. I got into a workout rut, got bored and haven't done anything for the past 2 1/2 weeks so when I got this in I was anxious for something new. It's like any typical video but this one actually works you out instead of killing you or being so slow you're finished before they are. Yes, the jokes are kinda cheesy, the ladies in the back aren't using much weight, blah, blah....whatever----I had such a good work out yesterday I can feel it all over, esp my legs. I love how he demonstrates every exercise. And as for some of the reviews saying it wasn't all that, it's like any routine. You have to tweak ANY fitness plan to your level. If you're expecting a \"made just for you\" workout, hire a personal trainer. The modifications you'd make would be simple. Someone mentioned it was a \"women's workout\" b/c it has women in it and b/c of the push-ups. Umm, get off your knees, on your toes, and place your hands a little closer together. See, a simple modification. The girls in the video not lifting enough for you? Umm, increase your weight. It's an awesome addition to any workout routine or a great start for those just beginning. I myself will still make my bowflex the foundation of my workouts but I like knowing I have something else I can do when I'm just not feeling the treadmill or weights", "domain": "dvd", "label": "positive"}
{"review": "A more apt description of this video would be \"The Floozie Workout.\"  If you are a woman and serious about fitness be prepared to be insulted by the two floozies featured with Tom Holland on this exercise video who provide unnecessary comic relief in this otherwise solid weight training workout video. The video is intended to provide a circuit training program to complement the Abs Diet, a diet developed and promoted by David Zinczkenko Editor-in-Chief of Men'sHealth magazine. The diet (details of which I won't elaborate on here) is a solid one and in many respects resembles the Weight Watcher Core program - it emphasizes a balance of protein, healthy fat, and complex carbs eaten in moderate portions. The video provides three tracks - one for the absolute beginner, a second for intermediates and a third for those more advanced.  Frankly, the advanced track is not all that advanced.  If you are interested in weight training and have no experience (be sure to consult your physician before starting an exercise program), I suggest you start with the beginner circuit.  After several weeks when you feel confident, you should be able to tackle the intermediate circuit and shortly thereafter the advanced circuits.  If you are looking for a serious weight training workout you should strongly consider Jari Love's \"Get Ripped\" workout - more rigorous, emphasizes tempo training, and grows with you (many variations demonstrated/discussed other than merely increasing the weight). The video opens with a very short cardio workout and then segues into the beginner's workout.  Holland introduces each exercise and then takes the viewer through one set of reps.  He is accompanied by two women who carry very light weights and go through the motions.  If you truly want to make this a circuit you need to repeat the exercise circuit at least once if not twice.  The intermediate and advanced circuits feature the same basic exercises as in the beginner circuit but take it up a \"notch\" by adding light weight to some exercises and in the advanced doing double duty on others (upper body/lower body).  If you are in any kind of shape you will probably benefit the most by combining all three circuits sequentially as cued on the video.  The whole workout will take less than one hour.  Don't expect abs though.  If you want abs you really need to watch your diet - eat really clean - and do some serious core work and this workout just doesn't have it.", "domain": "dvd", "label": "negative"}
{"review": "As a professional trainer, my biggest concern is for begginers or sedentary people in search of a safe, appropriate way to get started with an effective program. For these people, there are alot of bad choices out there. But this DVD is perfect for beginners - safe, efficient and not overwhelming - A great way to build a fitness foundation. Joey Atlas - The Wizard of Fitness www.AbsOfStoneCoreOfSteel.co", "domain": "dvd", "label": "positive"}
{"review": "I love the Abs Diet itself so I was expecting great things from the workout. It was pretty good, but the moves are nothing new. I was disappointed that the \"Advanced Total Body Circuit Training\" was actually just 12 squats, 12 lunges, and some push-ups and that was it. Don't get me wrong I felt it the next day, but only after I did the routine twice. The exercises are definitely effective, but they're nothing spectacular or new. Overall it's a great workout, but as you get a little stronger you can expect to have to do the routine more than once or add weight in order for it to be effective.", "domain": "dvd", "label": "positive"}
{"review": "I have two of the Prevention Fitness Systems dance videos and they are two of my three favorites.  I am familiar with the teachers from earlier Crunch dance work-out videos.   I have to work at it a bit to get my heart rate up to where I want it by putting in some extra oomph.  But it is do-able and I very much enjoy the routines.  They are the right length of time for me too.  I have a small amount of workout space and am able to do these in that space.  I look forward to my workout with this DVD", "domain": "dvd", "label": "positive"}
{"review": "This is one of my best buys of the year by far.  Marie Forleo who led Crunch Cardio Dance Blast leads you through this dance workout.  She is joined by 4 other ladies, a couple of them I have also seen in Crunch workouts.  The are 2-15 minute dance routines, Afro-Latin and Reggae Funk.  A warm up and isolations segment precedes the dance workouts and the cool down follows. The warmup is short and sweet, then you move into the isolations or dance basics segment.  These moves are designed to increase range of motion, coordination and muscle definition.  Some of the moves included her are shoulder rolls, hip circles, the box and more hip shakes.  This section is probably not necessary once you master the dance routines, but I find myself doing it anyway because I enjoy it, plus I like the music too. Afro latin is the first dance routine consisting of african tribal and latin moves.  Steps seen here are the triple step, strong arm movements, salsa, shoulder shimmeys, african footwork/arm movements, mambos, play the drums/maracas, double lunges, and hip shakes & shimmeys.  Marie will show the move first slowly, then will add arm movements, then will do the move at tempo, repeating a few times.  She does this for all the steps, once each move is added and practiced a few times, she will take the routine from the top. Once all the steps are learned, you will run through the entire routine twice at the end. Reggae funk is the second dance routine, steps in this segment include reggae groove, single single double steps, twist & shrugs, drop & roll, butterly, dig & freeze, and willy bounce and mambo sunshine.  Marie teaches this one in the same manner.  The routine starts out a little slow matching the music but picks up at the end and is a lot of fun.  After this segment Marie leads you through a brief cooldown and stretch. I really like this video, Marie is a great instructor.  I liked her quite well in Crunch Cardio Dance Blast and was hoping I would find another video with her in it.  This video is good for clutzy types like myself, the steps are pretty easy to pick up, though I can't seem to get the single single double step down for some reason.  Ths music is good, the set is clean and bright, and Marie and her participants seem to be enjoying themselves.  Is this workout a sweatfest?  No, but it's a nice way to get some light cardio and is great for days you are not up to a strenuous workout but want to get some movement. I find that I can be really lazy in the cardio department at times, but usually can muster up the energy to do this video. There are a few additional features on this DVD, a fitness do's and don'ts segment led by Chris Freytag, who leads many of the Prevention Fitness DVDs.  There is also a Spanish instructions option, which I haven't seen in  another workout.  Overall I highly recommend this one.  It has taken me a while to find a dance workout that I really like, I finally did", "domain": "dvd", "label": "positive"}
{"review": "This was a fun workout.  It really gets the heart rate up and it is easy to follow", "domain": "dvd", "label": "positive"}
{"review": "If you have reasonable expectations of exercise DVDs, then you will ignore the review written by \"AMAZON FAN\" and take heed of all of the other reviews.  Because this DVD is classified as a 'Fitness & Yoga' DVD, you do have to assume that it is a DVD for exactly that, 'Fitness'.  It is not, nor is it ever intended to be, an instructional for dance.  You're browsing in the wrong category if thats what you're after.  In fact, if you want to learn how to dance and will find yourself disappointed with any aerobics-esque moves, then shut down the computer now and go and sign up at your local dance studio. I own several dance aerobics DVDs and this is one of the best that I've tried so far - only topped by Madonna Grime's African Beat-Latin Heat DVD.  Few dance DVDs strike that balance between being dancy enough to be original & fun, and being easy to follow. This is as close as it gets to a perfect balance.  Marie Forleo is a fantastic instructor, and goes through fast moves at half tempo a few times before letting it fly at full speed.  That being said, full speed isn't breakneck speed; you are still able to actually DO the moves without compromising form. Here's what you get: 5MIN WARMUP - Marie takes you through about a 5min warmup that incorporates toe taps and step-touches - your basic aerobics stuff to get you started, and then with a few stretches to follow.  Its not incredibly innovative stuff, but hey, its the warmup.  It does its job, and thats all you can ask. ISOLATIONS - Now this is a good idea for those who are inexperienced with dance aerobics.  This short segment guides you on correct form when performing the moves, and is a must-do for those who are new to this sort of thing, and in particular, those who are inflexible in the hips. 15MIN AFRO-LATIN DANCE SEGMENT - This is my favourite segment on the DVD.  Marie goes through the majority of the moves at half tempo first - some of them are basic enough to learn at full tempo.  There is some pretty quick footwork in a salsa move that she teaches at the beginning of the combination, though with a few times practice you should have it down.  What struck me the most about this segment was that halfway through it the music suddenly picked up and was cleverly synched with the combination.  The first half is very much a 'getting-your-heart-rate-up-and-learning-the- moves' segment and the music at this point is fairly stock-standard stuff.  At the halfway point the music suddenly resembles that of a Brazilan Carnival, and it is at THIS point where you really start to get into the groove of the workout and find yourself having a blast. 15MIN REGGAE-FUNK DANCE SEGMENT - I wasn't too sure what to expect with this segment, since for me, Reggae Music has always made me want to go and lie down on a beach somewhere, rather than get on up and boogie.  The choreography in this segment is innovative and funky, but the music is exactly as Reggae music is - laid back.  The choreography does get your heart rate up and the moves are fun, but it doesn't draw you in like the Afro-Latin segment does. 5MIN COOLDOWN - Just like the warmup, this bit does its job.  Marie goes through a few simple, non-dance inspired, low impact moves to lower your heart rate.  Her stretches are not comprehensive, but they're not bad. There are a few extras on the disc; particularly a segment presented by Chris Freytag on 'The Do's and Don'ts of Exercise'.  Rather than the Do's and Don'ts of 'Exercise', this is specifically of 'Toning', and she demonstrates what poor technique looks like and what you should be doing instead. For those of you who have attempted the other Prevention Dance DVD with Jennifer Galardi, you can relax.  This DVD is nowhere near as fast paced as that one is.  That DVD is a Prevention Express DVD, where the segments are only 10 minutes long - designed for a 'pop-in-and-dash-out-the-door' lifestyle.  This DVD lengthens the segments a bit so that there is proper guidance on what to do, so you won't be left feeling as disheartened from trying to follow Marie's moves. Marie has one other DVD out, the 'Cardio Dance Blast' DVD from Crunch, which I found to be a bit slow and not as aerobic as this one is - though I have no gripes about her personality at all.  She focuses more on technique  and cueing rather than trying to motivate you.  If you're looking for someone who will take your hand and walk you through a workout, congratulating you on every single step you take and telling you that you're beautiful and that they're proud of you, you need a Denise Austin workout.  Marie is NOT Denise Austin (for some of you, knowing that will be enough to buy this DVD! Ha!) and cues and teaches very well.  You need to do the motivating yourself. IN SUMMARY - 2 x 15min Dance Segments - Isolations segment for newbies - Afro-Latin Segment is most fun - Choreography is innovative and funky - Complicated and/or Fast moves are taught at half tempo first - Marie is a good instructor, but does not try to motivate Highly Recommended", "domain": "dvd", "label": "negative"}
{"review": "I LOVE TO DANCE .........SO I WAS EXCITED TO GET THIS!! WHAT A BORING DVD!! DID NOT SWEAT!! HATED HER COMPLICATED MOVES!!!!! SHE IS PRETTY BUT NOT MOTIVATING.......MY KIDS AND I JUST SAT ON THE COUCH AND WATCHED IT THINKING ANY MINUTE IT WOULD PICK UP THE BEAT!  I THOUGHT IT WOULD HAVE REAL SPANISH LATIN AND REGGAE SONGS AND DANCING!!!!!!!!!!!! NO WAY IT WAS JUST SOME BEAT AND THESE GIRLS ALL DOING STEP TO SIDE THEN TO FRONT HANDS UP NOW TO THE SIDE......BLA BLA BLA.........WE EXPECTED UPBEAT MOTIVATING SONGS WITH LOTS OF DANCING AND FUN....I CANCELLED MY ORDER FOR ALL MY OTHER PREVENTION DVD'S ON THE WAY FOR FEAR THEY WOULD ALL BE LIKE THIS!!!! INCIDENTALLY I TRIED \"PICK YOUR SPOT PILATES\" FROM SOME OTHER GIRL AND IT WAS NOT ALOT OF MUSIC OR DANCE MOSTLY FLOOR EXCERCISE BUT IT WORKED AND HAD ME WANTING MORE .....SO I BLEW MY MONEY ON THIS THINKING IT WOULD BE MOTIVATING AND GIVE ME SOME CARDIO TO GO ALONG WITH THE FLOOR WORKOUT \"PICK YOUR SPOT\".....YOU ARE BETTER OFF TURNING ON THE RADIO AND JUMPING", "domain": "dvd", "label": "negative"}
{"review": "I have been trying to find a way to easily carry a lot of camera equipment for quite some time. I have tried backpacks, shoulder bags, duffel bags, but none of them really worked all that well. Then I saw the Lowepro Street and Field system with completely customizable pouches, vests, belts, and accessories. It works great, you only get the pouches you need so there is no waisted space and you can organize them however you want according to how often they are used (put frequently used items in easier to access places.) The variety alone of this system is worth the investment, but the quality and ease of use is also very high which is a big plus. You can get a case for any lens, camera body, or accessory you have. I even have cases for my cell phone and water bottle. One word of caution, be sure to measure your lens with the lens hood on backwards if you use them to make sure that the entire thing will fit into the pouch, because sometimes the lens will fit, but then the lens with the lens hood will not. I often carry 5-6 lenses, extension tubes, teleconverters, extra memory cards and batteries, and a bunch of cleaning supplies and other gadgets, which weights a ton. But when they are evenly distributed on this vest/belt Lowepro system it is actually very manageable. The only down side is that everyone will be staring at you because you have thousands of dollars of camera equipment strapped to your body. But if you can overlook that, this is the way to go. I have used this system at many zoos without ever having problems, in fact just unzipping a single lens and switching seems safer to me than opening an entire bag of equipment every time you want to switch lenses. Many of the cases also come with a built in rain/snow cover so if the weather changes all of your equipment is not destroyed. You can also put just a few pouches on a normal belt when you are just going to take photos in the back yard or don't need to take all of your equipment, which is nice. I really can't say enough about how much easier this makes traveling with a lot of equipment, if you have been hopelessly searching for a better solution, consider this, you won't regret it.", "domain": "electronics", "label": "positive"}
{"review": "I have been trying to find a way to easily carry a lot of camera equipment for quite some time. I have tried backpacks, shoulder bags, duffel bags, but none of them really worked all that well. Then I saw the Lowepro Street and Field system with completely customizable pouches, vests, belts, and accessories. It works great, you only get the pouches you need so there is no waisted space and you can organize them however you want according to how often they are used (put frequently used items in easier to access places.) The variety alone of this system is worth the investment, but the quality and ease of use is also very high which is a big plus. You can get a case for any lens, camera body, or accessory you have. I even have cases for my cell phone and water bottle. One word of caution, be sure to measure your lens with the lens hood on backwards if you use them to make sure that the entire thing will fit into the pouch, because sometimes the lens will fit, but then the lens with the lens hood will not. I often carry 5-6 lenses, extension tubes, teleconverters, extra memory cards and batteries, and a bunch of cleaning supplies and other gadgets, which weights a ton. But when they are evenly distributed on this vest/belt Lowepro system it is actually very manageable. The only down side is that everyone will be staring at you because you have thousands of dollars of camera equipment strapped to your body. But if you can overlook that, this is the way to go. I have used this system at many zoos without ever having problems, in fact just unzipping a single lens and switching seems safer to me than opening an entire bag of equipment every time you want to switch lenses. Many of the cases also come with a built in rain/snow cover so if the weather changes all of your equipment is not destroyed. You can also put just a few pouches on a normal belt when you are just going to take photos in the back yard or don't need to take all of your equipment, which is nice. I really can't say enough about how much easier this makes traveling with a lot of equipment, if you have been hopelessly searching for a better solution, consider this, you won't regret it.", "domain": "electronics", "label": "positive"}
{"review": "Bought this to free up my DVR - turn recorded movies into DVD's etc.  It works pretty well, accurate capture, easy to use.  Not crazy about the Software that's included.  Capwiz is OK, but limited, Ulead Video studio is clunky and sometime awkward to use, although between the two you can do just abou anything you need to.  It works BEST, if you record the HD version of shows.  Even if you don't have an HD TV, the converted image is much better", "domain": "electronics", "label": "positive"}
{"review": "The hook up and downloading the software was very simple.  There was a error problem with the drivers.  My computer is fairly new with windows xp.  I called there support and was told to try it on another computer. I install it on my neighbors computer and the same happened. I sent it back to Amazon and credit my account, and bought an other brand.  Amazon is so great about handling returns.", "domain": "electronics", "label": "negative"}
{"review": "With my Pentium 4, Windows XP system this was extremely easy to use and did not present any technical glitches. Very pleased", "domain": "electronics", "label": "positive"}
{"review": "I bought this to record Tivo DVR stuff to DVD.  Only mpeg capture device I have tried that gives a good quality picture.  Any other device I tried only worked converting to avi's, if at all.   Ulead's software is stable, and it's not a trial version.  If I use S-video instead of composite video, computer locks up (but that may be a problem on my end).  There are 2 different capture methods (Capwiz and Ulead's Video Studio).  Sound was a bit behind using Capwiz, use VS instead.  Would be nice to be able to set bitrate rather than be stuck with variable, but now I am just nitpicking", "domain": "electronics", "label": "positive"}
{"review": "I have lots of analog video tapes from the 80's and onwards.  This device works very well in transferring them.  The video & audio are in perfect sync. Pro: Very good device, very easy to use and install. You need a very powerful processor to work it right. Also, as I discovered and mentioned in the manual.  You must connect this device into the primary USB port. I have a hub where I first connected but the light was not coming on and the computer did not recognize the device. I opened the computer and made sure that it is connected directly into the USB attached to the motherboard and it worked very well.  The customer service is responsive but they will not work with you on your specific computer issues. Cons: This device is processor intensive.  You MUST have the latest processor running at 3.XX Mhz or above and turn off all other ancillary programs while you are converting.  I encountered no problems when I followed the above guidelines.  The minimum requirments listed by the manufacture is probably absolute minimum. It is a very good product and very easy to use.  I love it.", "domain": "electronics", "label": "positive"}
{"review": "I connected all the cables as instructed, but it doesn't work, the light is not on. So I return it to Amazon", "domain": "electronics", "label": "negative"}
{"review": "This product worked perfectly transferring to the computer and then using the included software to put several home movies on one DVD.  It also worked perfectly to transfer directly from VHSC tapes to DVD without transferring to computer.  Very simple set up and instructions.  The quality of the transferred videos was excellent!  You can also clip out parts of video seamlessly if you transfer to computer first very simply.  With the included software, you can do or add just about anything, music, frames, voice, etc.  No problems with the box getting hot or malfunctioning after over 4 hours of continuous use.", "domain": "electronics", "label": "positive"}
{"review": "I tryed to use this on an older p4 1500 megahz and had a few glitiches during the recording (loss of frames). Then I broke out the wifes new laptop and had no problem at all. The S video from my old High 8 Video Cam came out perfect.  Sound was perfect too. The point is you MUST have the power.  I do not care what the manufacture put on the box. I would have given it 5 stars if the recomended computer requirements matched what I had to use to get the results.", "domain": "electronics", "label": "negative"}
{"review": "I was very excited about this unit when I ordered it, but the pixelation was very bad due to the variable bit rate (VBR) encoding, and the DivX recording feature didn't actually work most of the time.  (A blank screen or a green screen was the result.)  Unfortunately, given these problems, I returned the unit.  I think I'm going to look at an older ADS unit without the VBR feature to ensure quality, and then do any DivX transfers by software.  It seems that the fewer variables involved may make for a higher quality image.  Too bad...this one really had a lot of potential", "domain": "electronics", "label": "negative"}
{"review": "It took a lot of searching before I decided to purchase a good printer and this one is a great one. The pictures are clear and they print fast. I showed them to friends and didn't tell them that I printed them at home and they were very surprised when I told them. Spend the extra money and get a good printer. This printer also include photo ink, which is really needed for a clean print. Make sure you also get the right paper", "domain": "electronics", "label": "positive"}
{"review": "... That said, I'm very happy with this printer. Other reviews, like the one on C|Net, have faulted the printer for mediocre text printing. I can't really address that complaint...have a laser printer for text and only use the S830 for printing photos and I'm very, very happy with how it performs that function. It's fast, I like being able to replace the ink cartridges separately, supports Exif if your digital camera outputs the encrypted data and the pictures are indistinguishable from those printed conventionally. It's the perfect color printer for my advanced amateur needs", "domain": "electronics", "label": "positive"}
{"review": "We bought this printer to go with the canon G2 we bought.Excellent choice.First I must say if you are considering buying it from anyone other than Amazon[.com],DON'T.I have dealt with Amazon[.com] for years and they are the best at what they do,no one comes close.The printer is so easy to setup,not like some of are other printers.We are using Window XP,it went like a breeze.in lees than 30 minutes I was printing pictures.... I am still learning all the features,but the quality of the pictuers is as good if not better than any other.. And it is fast fast,printed 2 4x6 pictures in less than 4 minutes,I have found that you do need to buy quality paper.I used the Canon 4x6 bordless paper first until I ran out, then I switched to another brand,big mistake.Use the right paper and you to will be amazed", "domain": "electronics", "label": "positive"}
{"review": "I've had this printer over a month now.  I have a Fujifilm S602 digital camera.  The quality of the photos, whether 4x6 or 8.5x11, is excellent.  The definition and sharpness of color are fantastic.  The creativity potential is outstanding.  I'm thrilled with this purchase", "domain": "electronics", "label": "positive"}
{"review": "I have the digital camera Canon Powershot S200 and just purchased this printer. Set it up last night without any difficulty and the photos I printed were fantastic. I am very pleased with this purchase. Would highly recommend this printer. I did use generic photo paper to start out with and it worked just fine. I am hoping that in the long run this printer will pay for itself and cut the costs of having pics developed at the store", "domain": "electronics", "label": "positive"}
{"review": "I bought this item, since I always make a lot of notes from books and other papers, and don't want to type it in manually anymore. This scanner, probably like any other model, needs a little training to get it right over the paper, but once done, it really works and faster than typing! I dont use the addressbook or options with your GSM but they are no doubt very handy. I just scan in from papers, and beam it to my laptop. Both Infrared and the cable work. The cable is especially great for using the scanner 'live'on the screen: the scanned text appears on the pc as you type! The dictionary also comes in very handy. It must be a very complex product, but just like the Ipod or ZenXtra mp3 players: they work! So buy one and save some time! Excellent and recommended for anyone that needs to make notes, or studies, or just wants to stop cutting out pages in newspapers in a train e.g", "domain": "electronics", "label": "positive"}
{"review": "I'm measuring, first and foremost, ease and precision of scanning. Speed of scanning and ease of installation on the computer are, in my mind, about the same for both the Wizcom QuickLink Elite and the C-Pen 800C. They differ sufficiently, however, in the primary question of ease and quality of scanning. For the record, I bought both at the same time, with the intent of keeping the better of the two. You can just go ahead and buy the C-Pen 800C. I have had one horrible experience with a pen scanner by Siemens, the \"Pocket Reader.\" It was truly useless. It scanned so poorly that I just put it aside. By the time I though to return it, Siemens was no longer making it, and I couldn't get customer service here in the U.S. The Wizcom QuickLink Elite is not so bad. It's serviceable. I don't think it lives up to its 95% accuracy guarantee, but perhaps meets a 90% threshold, measured impressionistically. It's interface is also reasonable and satisfactory. However, the C-Pen 800C is even more precise, truly approaching 95%. Moreover, if you discount errors in spacing from this accuracy percentage, its precision is even higher. Whereas the Wizcom is just as likely to make a content error, misread letters, etc., the 800C's errors are more likely to be the absence of a space when there should be one. A rare missed space doesn't make you puzzle over the text when you come back to it two months later. C-Pen is also lighter, and it's rechargeable, so while it's more expensive, in the long run, you'll save on batteries. Both have comparable single-language dictionaries, though Wizcom has more built in or for free (C-Pen allows you one free dictionary, including bilingual ones). Wizcom is a only a bit slower on the uptake, but significantly more likely to warn you \"Scan too fast.\" I've never had that from C-Pen, and again, the precision at any speed is appreciably better with C-Pen. Both have comparable PC and PDA compatibility capacity", "domain": "electronics", "label": "negative"}
{"review": "These are the basic clear cd and/or dvd SLIM JEWEL CASES that you are looking for. They are not as easily breakable as other brands. They are NOT recyclable", "domain": "electronics", "label": "positive"}
{"review": "As your DVD/CD collections grow, these are ideal for protecting and storing your \"treasures\". Easy to open and take up little storage space. The center lock tab is secure but allows you to remove the discs from the case with ease. Just a great product", "domain": "electronics", "label": "positive"}
{"review": "Works better than the Rabbit but still requires a little stength on some corks. Very good on most bottles", "domain": "housewares", "label": "positive"}
{"review": "I have two of these, the Brookstone (expensive) and the Houdini (1/3rd the cost).  Both work exceptionally well.  The Brookstone is all metal, and will certainly outlive me; the Houdini has some polycarbonate parts, which is why I gave it four of five stars, but feels pretty solid.  The remarkable thing is how easily they work -- two flips of the lever and the cork pops right out.  Another flip and the cork falls off the screw.  This thing really does work", "domain": "housewares", "label": "positive"}
{"review": "This worked really well when I first got it, but it seems as though it gets harder and harder to use as time goes by, almost as if it's wearing out.  And it's not when you insert the corkscrew into the wine, it's when you try to pull the cork out - it's almost impossible now.  So, bottom line is - it will work for maybe a year or two but then you'll need another, which to me isn't acceptable for the price I paid", "domain": "housewares", "label": "negative"}
{"review": "After 6 bottles and 3 people trying we still can't get this gadget to perform. Frankly I am amazed that anyone would review this positively, the directions are horrible and we resorted to our old 25 cent cork screw which opened fine. I bought this as a gift for my husband and it is going in the trash bad bad ba", "domain": "housewares", "label": "negative"}
{"review": "I bought this corkscrew last year after having some mishaps with my old double wing style corkscrew. All the reviews that talk about how easy it is to use are RIGHT on the money! I love it and recommend it highly! It is a breeze to use and I love how simple it is to remove the cork once the bottle is open. I got it for a low price but would happily have paid more knowing what I know now", "domain": "housewares", "label": "positive"}
{"review": "And this is one of them - I just can't figure it out.  I've gotten corks partially out, chewed a couple up, stuffed one down inside the bollle, sent a bottle skittering across the table, stabbed my finger and, yes, I did get one cork out like magic.  I just can't remember how I did it. The directions consist of 3 small drawings I found quite unhelpful.", "domain": "housewares", "label": "negative"}
{"review": "The reason this item is so inexpensive is that it works poorly and they are changing the engineering.  It will work okay for a while, but in short order will begin shoving your corks INTO the bottle rather than extracting them.  Buyer beware", "domain": "housewares", "label": "negative"}
{"review": "We've gone through two of these now, though not purchased from amazon. No way would we buy another one. They work fine for awhile, then suddenly stop working. No heat, just nothing at all. We're not heavy users, either; we make 2-3 cups of rice once or twice a week. Now we're shopping for a new rice maker, but it definitely won't be an Oster", "domain": "housewares", "label": "negative"}
{"review": "An excellent product and makes it so easy to slide cookies off once they have baked", "domain": "housewares", "label": "positive"}
{"review": "A great idea to slope 1 side.  Use for many other things other than cookies.  Use to slide a side of salmon off the grill", "domain": "housewares", "label": "positive"}
{"review": "I have three of these cookies sheets. 1 large and 2 small. I use one of the small ones in the camper and the other two at home. Some things stick, but not everything. Easy to clean and sturdy.", "domain": "housewares", "label": "positive"}
{"review": "I've had this blender for about a month and it does what it's supposed to. I use it mainly for smoothies or sauces: it crushes ice easily and efficiently. No problem so far.", "domain": "housewares", "label": "positive"}
{"review": "At the moment I am using it mainly for making smoothies, shakes, and malts.  I did crush ice using the instructions that came with the blender and it produced ice that would make a wonderful snow cone.  I put fruit in the smoothies and sometimes bananas in my malts.  Everything was processed smoothly.  I definitely recommend this blender.  Plus, I ordered this through Amazon.com and it was delivered on time, maybe even earlier than estimated", "domain": "housewares", "label": "positive"}
{"review": "I have been using my WaveLogic Blender for about a month now and I love it.  We use it for making smoothies and it works wonderful.  It blends the frozen fruit and mixes the ice very well.  My last blender was a Hamilton Beach also, but it did not compare to this new one.  It did not blend our ice. It left huge hunks in our smoothies.  The WaveLogic method is truly something to watch. I also like the hassle free shopping through Amazon. I was a frist time shopper at Amazon, but I surely use them again", "domain": "housewares", "label": "positive"}
{"review": "I have been using this belnder for more than 6 months now (paid $ 29.99 here on Amazon) and I just love it! I use it almost everyday to make a protein shake. I throw in a couple of sccops of protein powder, cup of soy millk, an appple, a banana and slices of water melon. The bleder works great in making a homogenous blend of all the ingedients. Thanks to the \"wave logic\" technology, it does work! It constantly mixes the contents by creating a wave like action with the help of the contoured jar. I love the sturdy and huge plastic jar. It is very durable and seems to last long. I replaced my previous (Hamilton beach) blender becuase the jar broke (very thin) at the bottom screw portion. I have also tried to make drinks with ice and the blender seems to handle the ice well, but there are still chunks of ice left in the drink. May be I should give it more time! Anyways, the bottom line is this blender is well worth the money and is highly recommended.", "domain": "housewares", "label": "positive"}
{"review": "I love not worrying about breaking the very heavy glass pitcher that most blenders come with. This blender has nice power and I love the \"Wavelogic\" for the smoothies we like to make. It really blends well and is very quiet compared to the previous \"old\" blender we had. Cleaning appears to be easier as well.", "domain": "housewares", "label": "positive"}
{"review": "Gives nice thin strips of peel.  Easy to use and clean.  Love it for lemon and orange peel", "domain": "housewares", "label": "positive"}
{"review": "This zester gives nice, thin slices of orange peel. I had to learn to use short strokes with the zester, otherwise the peel comes off in very long strings and must be chopped before use. The stainless steel is easy to clean", "domain": "housewares", "label": "positive"}
{"review": "We use this pan on a daily basis and it is great.  It provides very good heat control to your food.  It is a great size to cook a whole meal in.  Food browns well and always looks good.  The pan cleans up nicely too.  I have had mine for a year and a half and I am back online to buy some more Calphalon products", "domain": "housewares", "label": "positive"}
{"review": "It's the best pan I have ever owned. I just love it! I use it daily. Nothing sticks or burns in it.From omelettes to vegetables everything slides off. Cleaning is a breeze", "domain": "housewares", "label": "positive"}
